import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        Cli cli = new Cli(new Logic());
        cli.run();
    }


    //if login admin : create account is available
    //database should have a list of شماره دانشجویی و رمز

    /*لیست دروس ثبت نامی" را انتخاب کرد، باید بتواند تمام دروس
     ثبت نام شده خود را با جزئیات مانند نام استاد، نام درس،
    کد درس، ظرفیت، تعداد واحد، زمان کلاس، زمان امتحان، تخصصی
    یا عمومی بودن درس را ببیند و بتواند یک یا چند درس را با
    وارد کردن کد درس حذف کند. اگر گزینه "لیست دروس ارائه شده"
     را انتخاب کرد، لیست تمام دانشکده‌های موجود به دانشجو نشان
    داده شود و در این مرحله کاربر می‌تواند یکی از دانشکده‌ها را
     انتخاب کند. اگر دانشجو یکی از دانشکده‌ها را انتخاب کرد، باید
     بتواند لیست دروس ارائه شده آن دانشکده را با جزئیات مانند
     نام استاد، نام درس، کد درس، ظرفیت، تعداد واحد، زمان کلاس،
     زمان امتحان،  تخصصی یا عمومی بودن درس ببیند و بتواند یک
     یا چند درس را با وارد کردن کد درس اخذ کند(در صورت وجود ظرفیت)
*/
//یسری پراپرتی باید به کورس اضافه کنم
    //هردانشکده هاردکور باید یک لیست از کورس ها داشته باشه(سافت کور از فایل بخونم
    // باید کد وارد کنه و من بهش اطلاعات درسو بدم نه که هر کسشری خواست اد کنه)
}